def get_examples():
    examples = [{
    "input": """
'name': '모찌', 'breed': '개', 'sex': '중성화 Male', 'species': '몰티즈', 'birth': '2015-10-17', 'weight': '5 Kg', 'protector': '전경진(zoo)'
2024-04-17 11:12
Subjective
CC: 원무과)
[초진] 원무과)
심장약 먹고 있음. 방광결석 제거술 두번.
잔결석 확인은 이전에 했었음.
오줌 흘리고 다니는 것이 최근에 있어서. 검사. 요줌량. 싸는 것은 무리 없다.
음경뼈 위치 요도 결석. 방광에 작은 결석도 확인한 후 제거 해야할 거야..^^
Chart Image
2024-04-17 14:50
Subjective
CC: 외래,레퍼/방광결석 -> 정원장님 RAD_TA US_Echo,A
대표번호 ; 금일 오후에 초음파보고 결과 연락 (심장초음파, 복초)
> 수술 익일 예정 37.동의서, 마취동의서, 입원동의서 작성 필요 - 방광결석(내시경), 결석성분검사, -> 동의서 완료
+ 44번 동의서, (비장절제 후 kvl 의뢰)
S)
결석 재발로 진단받으심, 고추에 돌 있음
소변 볼 때 잘 보는 편이나 바닥에 조금 흘리면서 실수가 많음, 아파하는 것은 없음, 혈뇨 없음 (예전에 혈뇨 본 적 있어서 수술진행)
결석 수술 3번 진행 ; 개복
레이저파쇄술 하러 내원하심
GC)
식욕 활력 양호 ; 닥터힐메딕스 유리너리,알러지 겸용 사료 , anf 우유껌 , 오이, 고구마(약 먹이실 때 하루 2번)
배변 : 양호
MPH)
켁켁거리는 증상으로 심장병 진단 받으신 후 복용 중 - 강심제, 초기부터 복용 했음 , 심장초음파 보신 적은 없음
칼슘계열 결석으로 진단 받으심
o)
b.w : 5kg
t : 38.9'c / pr 160 / r : panting / bp : 160 #3
cardiac aus : NRF . 환자의 과도한 흥분으로 평가 제한적
Lung aus : NRF
RAD)thorax,abd#오 -VHS 10.5v -폐야 전반 경미한 기관지-간질 침윤 -> 노령성 변화, 기관지염 감별 추천 -방광 및 os penis mild 및 base 수준의 penile urethra 내 결석 관찰, 방광 팽만 -> 이후 retrohydroperfusion 후 요도 카테터 장착 영상에서는 요도 결석 방광 내로 이동한 것으로 고려됨 -양측 고관절 DJD 고려
US)Echo#오 Conclusion) --> MMVD ACVIM stage B1-2, mild PH(probability low) ; 일부 view에서 LV 수축능 다소 저하되어 관찰되었으나 환자의 빠른 심박 및 빈호흡 영향 고려, 추후 측정 시 정상범위 내로 측정되었으나 모니터링 필요
MV, TV 형태는 양호, mild MV prolapse -MR vmax 6.45m/s, PG 166.28mmHg -LVIDDN 1.93 LA/Ao 1.76
LVIDd 30.98mm LVIDs 16.08mm FS 48.10% -E peak 0.85m/s, E/A 1.18 E'/A'>1, E/E' 8.93 -TR vmax 2.62m/s 27.44mmHg
US)abd#오 -담낭 슬러지, 폐색 의심 소견 관찰되지 않음 -간실질 전반에서 경계 불분명한 저에코 결절 다수 산재, 간 margin blunt하게 관찰 -> nodular hyperplasia, vacuolar hepatopathy 고려, 초기 cirrhosis로의 진행 감별 추천, 간수치 확인 추천됨 -비장 head의 heterogeneous하게 저에코성 결절 약 1.7*1.7cm 크기로 관찰, 내부로 혈류 유입 관찰 -> 양/악성 감별 위한 조직검사 추천됨 -양측 신장 피질 에코 상승 및 CM definition 저하, 피질 고에코 foci 및 작은 cyst 소수, 게실의 결석 일부 관찰, 폐색 의심 소견 관찰되지 않음 -> CKD, 노령성 변화 감별 추천 -방광 내 작은 결석 다수 관찰, 방광벽은 양호하게 관찰
P)
Retrohydroperfusion
본원 레이저시술 진행 X, PCCL 안내도와드림 ; 수술 후 1-2주 정도 비뇨기 증상 보일 수 있음, 혈뇨 증상 (집도의 정희준원장님 안내)
+ 마취전검사상 비장의 저에코 결절이 확인되며 혈관화 발달되어있어 조직검사 권장, 마취 시 동시 진행하기로 함
금일 입원 후 마취전검사, 익일 수술 예정 , 평균 2-3일 입원 이나 환자 상태에 따라 변동 있음
Chart Image
2024-04-17 16:33
Subjective
CC: 원무과 - 입원체크리스트
먼지 알러지 (모기 물린것처럼 부어오름)
실내배변
Subjective
2024-04-17 16:38
CC: 레퍼피드백, 차트열람체크완
안녕하세요 원장님 울산에스동물메디컬센터 정유정 수의사입니다.
금일 요도 결석으로 보내주신 전경진님 모찌의 경우 내원 당시 요도 os penis 내 다수의 결석 확인되어 retrohydroperfusion 진행하였고 방광 내 환납 하였습니다. 안정화 후 익일 수술 예정이시며 수술 시 다시 한 번 연락드리겠습니다
소중한 환자 의뢰해주셔서 감사합니다.
피드백 카톡 전송완료 , 웹차트 안내문자 완료
Chart Image
2024-04-17 17:38
Subjective
CC: 원무과) 비장적출술 동의서
[초진] 원무과) 비장적출술 동의서
추가 수술비용 퇴원시 수납예정 - 유정원장님 컨펌
Chart Image
2024-04-18 09:55
Subjective
CC: 세균배양검사결과(뇨)
[초진] 세균배양검사결과(뇨)
세균배양검사결과 (뇨) -MAC,BAP 균 안자람(사진첨부)
4/19까지 보관예정 -입원중
4/19 세균배양검사결과 -MAC,BAP 균 안자람 -검사종료(폐기)
Chart Image
2024-04-18 16:08
Subjective
CC: 방광결석(방광경) , 비장 절제 POD0 정희준
[초진] 방광결석(방광경) , 비장 절제 POD0
Tx)
AMC 12.5mpk BID
Famo 0.5mpk BID
Morphine 0.3mpk BID 3days
피드백완료
Chart Image
2024-04-19 10:17
Subjective
CC: 방광결석(방광경) , 비장 절제 POD1
소변양호
술부양호
내일 뇨카 제거
퇴원여부 결정되면 전화
Chart Image
2024-04-20 10:10
Subjective
CC: 방광결석(방광경) , 비장 절제 POD2->정유정 인계
퇴원 시 비장절제, 조직검사 비용 수납 필요 (술전에 미리 비용안내완료)
S)
자발 배뇨 o , 혈뇨 양상 > 보호자님께 오늘 퇴원 어렵고 1~2일 정도 오줌 양상 지켜봐야한다고 말씀드림. 저녁에 전화 한 통 부탁드립니다
O)
CRP 3.3
PCV WBC정상
보호자 통화완료
내일 소변양상과 초음파 검사후 이상없으면 퇴원진행해주세요
Chart Image
2024-04-21 09:57
Subjective
CC: 방광결석(방광경) 비장절제 POD3 US_E
금일 퇴원 금요일 혹은 토요일날 재진 희망 (비뇨기초음파 같이) / 펜타닐패치 12 부착, 23일경 제거 필요
> 초음파 일정으로 금요일 11시 예약 도와드림
S)
식욕 g
활력 g
배변 x
배뇨 : 정상뇨 , 끝에 혈뇨 양상
US)UB#윤
방광 내 다수의 선상의 mixed echogenicity의 material floating -> 혈괴/debris/sludge 고려되며 배뇨 양상 확인 필요
방광 전방 봉합부 비후 관찰, 방광 주변부 지방 고에코성 변화 -> 술 후 변화로 판단됨
비장 절제부 주변 지방 고에코성 변화 -> 술후 변화로 판단됨
p)
금일 퇴원 ; 비뇨기 증상 1~2주 정도 보일 수 있음
> 일주일 후 재진 (넥칼라 착용, 내복약, 술부 소독, 연고 도포, 산책 및 미용,목욕은 재진 이후 결정)
퇴원약(내복약)3층 병동 보관중
소독,연고2층 처치실 보관중
원무과) 방광결석술후 질병관리 안내문자 전송완료
Chart Image""",
"answer" : """
#출력 :
    Signalment
    Name : 모찌
    Breed : 말티즈
    Species : 개
    Age : 8y 6m
    Sex : CM
    BW :  5kg

    Chief Compliant
    소변 흘리는 증상 
    결석수술 개복 3번 이력
    요도 내 결석으로 내원 

    Definitive Diagnosis
    방광결석
    비장종괴

    Surgery
    방광결석 : 복벽 1cm 절개하여 PCCL 진행
    비장절제 : 방광수술 마무리 후 복벽 연장하여 절개하여 제거 

    Plan & Client Education
    피부 최소절개후 경성 방광경이용 결석제거(PCCL)
    마취전검사상 비장의 저에코 결절이 확인되며 혈관화 발달되어있어 조직검사 권장, 마취 시 동시 진행하기로 함 

    Postoperative care
    수술 후 3일차 퇴원 : 식욕 활력 양호하며 자발배뇨 원활하나 혈뇨 증상 간헐적으로 보이는 상황으로 비뇨기증상은 수술 후 1-2주 정도 보이실 수 있음 안내드림
    Ca Ox ; 칼슘계열 결석 - 인함량 낮은 음식, 칼륨 수치 높은 음식 피해주세요
    비장 조직검사 ; 진행중"""
},
{
    "input" : """'name': '모찌', 'breed': '개', 'sex': '중성화 Male', 'species': '몰티즈', 'birth': '2015-10-17', 'weight': '5 Kg', 'protector': '전경진(zoo)'
2024-04-17 11:12
Subjective
CC: 원무과)
[초진] 원무과)
심장약 먹고 있음. 방광결석 제거술 두번.
잔결석 확인은 이전에 했었음.
오줌 흘리고 다니는 것이 최근에 있어서. 검사. 요줌량. 싸는 것은 무리 없다.
음경뼈 위치 요도 결석. 방광에 작은 결석도 확인한 후 제거 해야할 거야..^^
Chart Image
2024-04-17 14:50
Subjective
CC: 외래,레퍼/방광결석 -> 정원장님 RAD_TA US_Echo,A
대표번호 ; 금일 오후에 초음파보고 결과 연락 (심장초음파, 복초)
> 수술 익일 예정 37.동의서, 마취동의서, 입원동의서 작성 필요 - 방광결석(내시경), 결석성분검사, -> 동의서 완료
+ 44번 동의서, (비장절제 후 kvl 의뢰)
S)
결석 재발로 진단받으심, 고추에 돌 있음
소변 볼 때 잘 보는 편이나 바닥에 조금 흘리면서 실수가 많음, 아파하는 것은 없음, 혈뇨 없음 (예전에 혈뇨 본 적 있어서 수술진행)
결석 수술 3번 진행 ; 개복
레이저파쇄술 하러 내원하심
GC)
식욕 활력 양호 ; 닥터힐메딕스 유리너리,알러지 겸용 사료 , anf 우유껌 , 오이, 고구마(약 먹이실 때 하루 2번)
배변 : 양호
MPH)
켁켁거리는 증상으로 심장병 진단 받으신 후 복용 중 - 강심제, 초기부터 복용 했음 , 심장초음파 보신 적은 없음
칼슘계열 결석으로 진단 받으심
o)
b.w : 5kg
t : 38.9'c / pr 160 / r : panting / bp : 160 #3
cardiac aus : NRF . 환자의 과도한 흥분으로 평가 제한적
Lung aus : NRF
RAD)thorax,abd#오 -VHS 10.5v -폐야 전반 경미한 기관지-간질 침윤 -> 노령성 변화, 기관지염 감별 추천 -방광 및 os penis mild 및 base 수준의 penile urethra 내 결석 관찰, 방광 팽만 -> 이후 retrohydroperfusion 후 요도 카테터 장착 영상에서는 요도 결석 방광 내로 이동한 것으로 고려됨 -양측 고관절 DJD 고려
US)Echo#오 Conclusion) --> MMVD ACVIM stage B1-2, mild PH(probability low) ; 일부 view에서 LV 수축능 다소 저하되어 관찰되었으나 환자의 빠른 심박 및 빈호흡 영향 고려, 추후 측정 시 정상범위 내로 측정되었으나 모니터링 필요
MV, TV 형태는 양호, mild MV prolapse -MR vmax 6.45m/s, PG 166.28mmHg -LVIDDN 1.93 LA/Ao 1.76
LVIDd 30.98mm LVIDs 16.08mm FS 48.10% -E peak 0.85m/s, E/A 1.18 E'/A'>1, E/E' 8.93 -TR vmax 2.62m/s 27.44mmHg
US)abd#오 -담낭 슬러지, 폐색 의심 소견 관찰되지 않음 -간실질 전반에서 경계 불분명한 저에코 결절 다수 산재, 간 margin blunt하게 관찰 -> nodular hyperplasia, vacuolar hepatopathy 고려, 초기 cirrhosis로의 진행 감별 추천, 간수치 확인 추천됨 -비장 head의 heterogeneous하게 저에코성 결절 약 1.7*1.7cm 크기로 관찰, 내부로 혈류 유입 관찰 -> 양/악성 감별 위한 조직검사 추천됨 -양측 신장 피질 에코 상승 및 CM definition 저하, 피질 고에코 foci 및 작은 cyst 소수, 게실의 결석 일부 관찰, 폐색 의심 소견 관찰되지 않음 -> CKD, 노령성 변화 감별 추천 -방광 내 작은 결석 다수 관찰, 방광벽은 양호하게 관찰
P)
Retrohydroperfusion
본원 레이저시술 진행 X, PCCL 안내도와드림 ; 수술 후 1-2주 정도 비뇨기 증상 보일 수 있음, 혈뇨 증상 (집도의 정희준원장님 안내)
+ 마취전검사상 비장의 저에코 결절이 확인되며 혈관화 발달되어있어 조직검사 권장, 마취 시 동시 진행하기로 함
금일 입원 후 마취전검사, 익일 수술 예정 , 평균 2-3일 입원 이나 환자 상태에 따라 변동 있음
Chart Image
2024-04-17 16:33
Subjective
CC: 원무과 - 입원체크리스트
먼지 알러지 (모기 물린것처럼 부어오름)
실내배변
Subjective
2024-04-17 16:38
CC: 레퍼피드백, 차트열람체크완
안녕하세요 원장님 울산에스동물메디컬센터 정유정 수의사입니다.
금일 요도 결석으로 보내주신 전경진님 모찌의 경우 내원 당시 요도 os penis 내 다수의 결석 확인되어 retrohydroperfusion 진행하였고 방광 내 환납 하였습니다. 안정화 후 익일 수술 예정이시며 수술 시 다시 한 번 연락드리겠습니다
소중한 환자 의뢰해주셔서 감사합니다.
피드백 카톡 전송완료 , 웹차트 안내문자 완료
Chart Image
2024-04-17 17:38
Subjective
CC: 원무과) 비장적출술 동의서
[초진] 원무과) 비장적출술 동의서
추가 수술비용 퇴원시 수납예정 - 유정원장님 컨펌
Chart Image
2024-04-18 09:55
Subjective
CC: 세균배양검사결과(뇨)
[초진] 세균배양검사결과(뇨)
세균배양검사결과 (뇨) -MAC,BAP 균 안자람(사진첨부)
4/19까지 보관예정 -입원중
4/19 세균배양검사결과 -MAC,BAP 균 안자람 -검사종료(폐기)
Chart Image
2024-04-18 16:08
Subjective
CC: 방광결석(방광경) , 비장 절제 POD0 정희준
[초진] 방광결석(방광경) , 비장 절제 POD0
Tx)
AMC 12.5mpk BID
Famo 0.5mpk BID
Morphine 0.3mpk BID 3days
피드백완료
Chart Image
2024-04-19 10:17
Subjective
CC: 방광결석(방광경) , 비장 절제 POD1
소변양호
술부양호
내일 뇨카 제거
퇴원여부 결정되면 전화
Chart Image
2024-04-20 10:10
Subjective
CC: 방광결석(방광경) , 비장 절제 POD2->정유정 인계
퇴원 시 비장절제, 조직검사 비용 수납 필요 (술전에 미리 비용안내완료)
S)
자발 배뇨 o , 혈뇨 양상 > 보호자님께 오늘 퇴원 어렵고 1~2일 정도 오줌 양상 지켜봐야한다고 말씀드림. 저녁에 전화 한 통 부탁드립니다
O)
CRP 3.3
PCV WBC정상
보호자 통화완료
내일 소변양상과 초음파 검사후 이상없으면 퇴원진행해주세요
Chart Image
2024-04-21 09:57
Subjective
CC: 방광결석(방광경) 비장절제 POD3 US_E
금일 퇴원 금요일 혹은 토요일날 재진 희망 (비뇨기초음파 같이) / 펜타닐패치 12 부착, 23일경 제거 필요
> 초음파 일정으로 금요일 11시 예약 도와드림
S)
식욕 g
활력 g
배변 x
배뇨 : 정상뇨 , 끝에 혈뇨 양상
US)UB#윤
방광 내 다수의 선상의 mixed echogenicity의 material floating -> 혈괴/debris/sludge 고려되며 배뇨 양상 확인 필요
방광 전방 봉합부 비후 관찰, 방광 주변부 지방 고에코성 변화 -> 술 후 변화로 판단됨
비장 절제부 주변 지방 고에코성 변화 -> 술후 변화로 판단됨
p)
금일 퇴원 ; 비뇨기 증상 1~2주 정도 보일 수 있음
> 일주일 후 재진 (넥칼라 착용, 내복약, 술부 소독, 연고 도포, 산책 및 미용,목욕은 재진 이후 결정)
퇴원약(내복약)3층 병동 보관중
소독,연고2층 처치실 보관중
원무과) 방광결석술후 질병관리 안내문자 전송완료
Chart Image""",
    "answer" : """Signalment
    Name : 희망
    Breed : 치와와
    Species : 개
    Age : 9Y
    Sex : CM
    BW :  2.3 kg

    Chief Compliant
    Zoo ah에서 스케일링 전 검사중 요도 및 방광내 결석 확인
    결석에 의한 증상은 없었음

    Definitive Diagnosis
    방광결석, 신장결석
    다량의 치석 및 치은염

    Plan & Client Education
    피부 최소절개후 경성 방광경이용 결석제거(PCCL)
    마취 깨우지 않고 바로 치과방사선 촬영 및 스케일링, 필요하면 발치 진행

    Anesthesia record
    마취중 바이탈 정상

    Postoperative Care
    Tx)
    퇴원당일 기침증상 보여 기관확장제 진해거담제, PDS추가처방"""
}

]
    return examples